{
  "backend/main.mo": "Motoko backend actor handling contact inquiries, user profiles, and authorization checks with public endpoints for submitting inquiries and retrieving contact details.",
  "feature_evidence.json": "JSON report documenting feature requirements, affected files, components, and test IDs for Instagram-related UI updates.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files and components.",
  "frontend/index.css": "Tailwind base configuration defining root CSS variables for light and dark themes and global styling rules.",
  "frontend/index.html": "Main HTML template setting metadata, dynamic canonical/OG URLs, and loading the React entrypoint.",
  "frontend/public/robots.txt": "Robots.txt allowing all user agents and referencing the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing key site URLs with change frequency and priority placeholders.",
  "frontend/src/App.tsx": "Sets up TanStack Router with core site routes using a shared layout component.",
  "frontend/src/components/site/ContactDetails.tsx": "UI component fetching and displaying contact details, computing website URL, and providing copy-to-clipboard sharing.",
  "frontend/src/components/site/CoverageSection.tsx": "Displays Europe-wide and international coverage details with icons and descriptive text.",
  "frontend/src/components/site/HowItWorks.tsx": "Three-step delivery process component using cards and icons to illustrate workflow.",
  "frontend/src/components/site/MarketingCard.tsx": "Reusable card component displaying an icon, title, and description with styling.",
  "frontend/src/components/site/Section.tsx": "Wrapper component that renders a padded section with a container and optional id.",
  "frontend/src/components/site/ServicesPreview.tsx": "Displays a grid of service marketing cards and a button linking to the full services page.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with branding, navigation links, service list, contact info, and copyright text.",
  "frontend/src/components/site/SiteHeader.tsx": "Header with logo, desktop and mobile navigation, and contact button using a responsive sheet menu.",
  "frontend/src/components/site/SiteLayout.tsx": "Page layout including header, routed content via Outlet, and footer.",
  "frontend/src/components/site/ValueProps.tsx": "Grid of marketing cards highlighting key value propositions like speed, security, and support.",
  "frontend/src/components/site/VideoSection.tsx": "Section showing an Instagram promo header and an embedded video with fallback image on error.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Mutation hook that validates inquiry data and submits it via the backend actor, then invalidates cache.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom theme variables for light and dark modes, and utility classes including a complex hero background style.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company overview, mission, values, and supporting imagery.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission handling, and displays contact details.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section, value props, video section, services preview, and a call‑to‑action.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a services overview, how‑it‑works section, and additional service details using marketing components.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing them in sessionStorage, and clearing them from the URL hash. Supports both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins for the frontend. Includes container settings, custom color tokens, and extended utilities.",
  "frontend/VIDEO_ASSET.md": "Instructions detailing where video and fallback assets must be placed in the frontend and how they are served.",
  "project_state.json": "Describes the current project state, requirements, known issues, and planned features for the KK Euro Express website. Tracks architectural notes, service updates, and configuration problems like video upload failures."
}