{
  "backend/main.mo": "Motoko canister managing contact inquiries, user profiles, and contact details with access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report describing a fallback image replacement task with related components and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files including layout, pages, components, and theme config.",
  "frontend/index.css": "Tailwind base styles and OKLCH‑based color variables defining light and dark themes.",
  "frontend/index.html": "HTML template setting metadata, dynamic canonical/OG URLs, and mounting the React app.",
  "frontend/public/robots.txt": "Robots file allowing all user agents and linking to sitemap.xml.",
  "frontend/public/sitemap.xml": "Static sitemap listing home, services, about, and contact URLs with priorities and frequencies.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, Services, About, and Contact using a shared layout.",
  "frontend/src/components/site/ContactDetails.tsx": "Fetches backend contact details and displays email, phone, address, website, and sharing UI.",
  "frontend/src/components/site/CoverageSection.tsx": "Two‑column section outlining worldwide shipping coverage and regional expertise.",
  "frontend/src/components/site/HowItWorks.tsx": "Three‑step process component showing pickup, worldwide shipping, and delivery stages.",
  "frontend/src/components/site/MarketingCard.tsx": "Reusable card component for marketing content with optional icon, title, and description.",
  "frontend/src/components/site/Section.tsx": "Wrapper component that renders a padded section with an inner container.",
  "frontend/src/components/site/ServicesPreview.tsx": "Displays a grid of service marketing cards and a button linking to the full services page.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with brand info, quick links, services list, contact details, and copyright.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive site header with logo, navigation links, and mobile menu via a sheet drawer.",
  "frontend/src/components/site/SiteLayout.tsx": "Page layout that wraps content with the site header and footer using an Outlet for routing.",
  "frontend/src/components/site/ValueProps.tsx": "Shows a grid of value proposition marketing cards with icons and descriptions.",
  "frontend/src/components/site/VideoSection.tsx": "Section displaying an Instagram promo header and a video with fallback image on error.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state tracking.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Mutation hook that validates inquiry data and submits it via the backend actor, refreshing inquiry queries.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, base typography, and a custom hero background utility.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company overview, mission, values, and imagery.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission handling, and contact details.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero, value props, video section, services preview, and a call‑to‑action.",
  "frontend/src/pages/ServicesPage.tsx": "Presents a services list, how‑it‑works section, and additional info on custom solutions and tracking.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read URL params (including hash), persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and includes typography, container-queries, and animate plugins.",
  "frontend/VIDEO_ASSET.md": "Instructions for placing and replacing the home page video and fallback image in the public assets folder.",
  "project_state.json": "Defines the project state, including requirements, feature list, content updates, issues, and architectural notes for the KK Euro Express website."
}