{
  "backend/main.mo": "Motoko backend actor handling contact inquiries, user profiles, and authorization-guarded queries and mutations.",
  "feature_evidence.json": "Feature evidence report identifying files affected by removing 'same-day delivery' wording from frontend content.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing major frontend files, components, and pages across the app.",
  "frontend/index.css": "Global Tailwind base styles defining color tokens, dark mode variables, and shared styling rules.",
  "frontend/index.html": "Root HTML template containing the app mount node and loading the main React entry script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for Home, Services, About, and Contact inside the main layout.",
  "frontend/src/components/site/ContactDetails.tsx": "Fetches contact details from the backend and displays email, phone, and website with icons.",
  "frontend/src/components/site/CoverageSection.tsx": "Displays Europe-wide and international coverage details with icons and descriptive text.",
  "frontend/src/components/site/HowItWorks.tsx": "Three-step illustrated process component showing pickup, shipping, and delivery stages.",
  "frontend/src/components/site/MarketingCard.tsx": "Reusable card component for showing an icon, title, and description with simple styling.",
  "frontend/src/components/site/Section.tsx": "Generic layout wrapper providing consistent padded sections with a container.",
  "frontend/src/components/site/ServicesPreview.tsx": "Shows three featured service cards with icons and a button linking to the full Services page.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer displaying brand info, navigation links, services list, contact details, and attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with logo, desktop nav links, and mobile menu using Sheet components.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout wrapper providing header, footer, and routed page content.",
  "frontend/src/components/site/ValueProps.tsx": "Displays a grid of marketing value cards with icons, titles, and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, storage, and status.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Mutation hook that validates and submits inquiry data to the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables with light/dark theme and utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "About page with hero, company overview, mission, values, and imagery.",
  "frontend/src/pages/ContactPage.tsx": "Implements the contact form with validation, submission via useSubmitInquiry, and displays success or error states alongside contact details.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, value propositions, a services preview, and a strong call-to-action linking to contact and services pages.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a hero section, a grid of service cards, a how‑it‑works section, and extra info on custom solutions and insurance/tracking.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, clearing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including requirements, features, architectural notes, and metadata for the KK Euro Express website."
}