{
  "backend/main.mo": "Motoko backend handling contact inquiries and user profiles with access control, including public inquiry submission and admin/user-restricted queries.",
  "feature_evidence.json": "Feature evidence report listing feature requirements, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files including layout, components, pages, and styling.",
  "frontend/index.css": "Tailwind base/theme variable definitions and light/dark mode color tokens for global styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Home, Services, About, and Contact using SiteLayout.",
  "frontend/src/components/site/ContactDetails.tsx": "Displays contact info fetched from the backend with fallback defaults for email, phone, and website.",
  "frontend/src/components/site/CoverageSection.tsx": "Shows Europe-wide and international coverage details with icons and explanatory text.",
  "frontend/src/components/site/HowItWorks.tsx": "Three-step visual process for pickup, shipping through an international network, and delivery.",
  "frontend/src/components/site/MarketingCard.tsx": "Reusable card component for marketing items with icon, title, and description.",
  "frontend/src/components/site/Section.tsx": "Wrapper providing consistent spacing and container width for page sections.",
  "frontend/src/components/site/ServicesPreview.tsx": "Displays three featured services with icons and descriptions plus a link to the full Services page.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with branding, navigation links, services, contact info, and a dynamic year plus a referral link.",
  "frontend/src/components/site/SiteHeader.tsx": "Provides a responsive site header with logo, navigation links, and a mobile menu using a Sheet component.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the main page layout including header, footer, and routed content via Outlet.",
  "frontend/src/components/site/ValueProps.tsx": "Displays a grid of marketing value proposition cards with icons, titles, and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook managing identity state, login, and logout.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Provides a mutation for submitting inquiries to the backend with basic validation and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS base plus custom theme variables and utility classes, including light/dark styles and hero background effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company overview, mission, values, and an image using multiple Section components.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission handling, and contact details layout.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, value propositions, services preview, and a call-to-action.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services overview with a grid of service cards, a process explanation, and extra shipping info.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata for building the KK Euro Express website, including schema version, architectural notes, and a list of defined features. It outlines required pages, branding, and content guidelines for the multi-page site."
}