{
  "kind": "build_request",
  "title": "Remove “Same day delivery” from all site copy",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Remove all mentions of “Same day delivery” (including variants like “same-day”) from user-facing site content and service descriptions, and replace with wording that does not promise same-day delivery.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "same day delivery remove it"
        ]
      },
      "acceptanceCriteria": [
        "The Home page no longer includes the phrase “same-day” / “same day” in the hero paragraph (currently mentions “express same-day delivery”).",
        "The Services preview section no longer includes “Same-day and next-day delivery” wording in the Express Delivery card description.",
        "The Value Props section no longer includes “same-day and next-day service” wording in the “Lightning Fast” value proposition.",
        "The Services page “Domestic Courier” description no longer includes “From same-day to standard shipping”.",
        "A repository-wide check confirms there are no remaining user-facing occurrences of “same day” or “same-day” related to delivery promises in the frontend pages/components updated for this change."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify Internet Identity / actor hook files listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change the set of services offered (International courier, Domestic courier, Vacuum service, Indo-Canadian bus service).",
    "Do not add new pages, routes, or backend APIs as part of this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}