{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove “Same day delivery” promise from marketing copy",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Remove all “same day” / “same-day” delivery promise language from user-facing copy and replace with non-committal wording.",
      "acceptanceCriteria": [
        "The Home page no longer includes the phrase “same-day” / “same day” in the hero paragraph (currently mentions “express same-day delivery”).",
        "The Services preview section no longer includes “Same-day and next-day delivery” wording in the Express Delivery card description.",
        "The Value Props section no longer includes “same-day and next-day service” wording in the “Lightning Fast” value proposition.",
        "The Services page “Domestic Courier” description no longer includes “From same-day to standard shipping”.",
        "A repository-wide check confirms there are no remaining user-facing occurrences of “same day” or “same-day” related to delivery promises in the frontend pages/components updated for this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the hero paragraph copy to remove the “express same-day delivery” promise and replace with wording that communicates speed without promising same-day delivery."
        },
        {
          "path": "frontend/src/components/site/ServicesPreview.tsx",
          "operation": "modify",
          "description": "Update the Express Delivery card description to remove “Same-day and next-day delivery” language and replace with non-committal express/priority wording that does not promise same-day delivery."
        },
        {
          "path": "frontend/src/components/site/ValueProps.tsx",
          "operation": "modify",
          "description": "Update the “Lightning Fast” value proposition description to remove “same-day and next-day service” and replace with wording that highlights speed without promising same-day delivery."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Update the “Domestic Courier” service description to remove “From same-day to standard shipping” and replace with phrasing that describes multiple service speeds without promising same-day delivery. After edits, perform a repository-wide search within frontend for remaining user-facing “same day” / “same-day” mentions tied to delivery promises and correct any found in the touched pages/components."
        }
      ]
    }
  ]
}